Jmeter.Scripts/Scripts/Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="AudioNormalTG" enabled="false">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Audio normal" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">4550</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/audio/preview/1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept</stringProp>
              <stringProp name="Header.value">audio/mpeg</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6IjVCM25SeHRRN2ppOGVORGMzRnkwNUtmOTdaRSJ9.eyJhdWQiOiJkZWMzYmUzMC02MzI1LTQzMzUtYjg5OC1lYjAxOTg1ZDZjOTAiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vNTMxZmY5NmQtMGFlOS00NjJhLThkMmQtYmVjN2MwYjQyMDgyL3YyLjAiLCJpYXQiOjE3MDY2Mjc4NTksIm5iZiI6MTcwNjYyNzg1OSwiZXhwIjoxNzA2NjMyNDc0LCJhaW8iOiJBVFFBeS84VkFBQUFxOFZscGlOT0NPcXdSczZvaUIzTVplbUVXOUsxSGE4SmxMWlR3enRwWm16YWtQUk1INHZ1Mm0zNU1BM0lRWlVaIiwiYXpwIjoiZGVjM2JlMzAtNjMyNS00MzM1LWI4OTgtZWIwMTk4NWQ2YzkwIiwiYXpwYWNyIjoiMSIsIm5hbWUiOiJkYXJ0c2ludGVybmFsZnVuY3Rpb25hbHRlc3R1c2VyIiwib2lkIjoiYjNiN2VkN2YtOTU5Ni00NmVjLWExMTktYmZiNjJkYThhMzM4IiwicHJlZmVycmVkX3VzZXJuYW1lIjoiZGFydHNpbnRlcm5hbGZ1bmN0aW9uYWx0ZXN0dXNlckBITUNUUy5ORVQiLCJyaCI6IjAuQVNBQWJma2ZVLWtLS2thTkxiN0h3TFFnZ2pDLXc5NGxZelZEdUpqckFaaGRiSkFnQUpJLiIsInNjcCI6ImRhcnRzaW50ZXJuYWx1c2VyIEZ1bmN0aW9uYWwuVGVzdCIsInN1YiI6IlJ4eXlyWjlydjlyMUNfQl93bkcxaEZGZEFwclNSaGlUQ3YwUjF2SGxaYXMiLCJ0aWQiOiI1MzFmZjk2ZC0wYWU5LTQ2MmEtOGQyZC1iZWM3YzBiNDIwODIiLCJ1dGkiOiJldzJLaHZKSjQwMlkwMXBDZXZoOEFBIiwidmVyIjoiMi4wIn0.31mrMnp7PW8eTnCy9BoIwccM_EDadc59gLXH8Gqu19zYRUhBYBIHrHQYBWt1qAPaV82josBSj8sTTJmek5Ks-2tdebGfsq6Gq2S6GtGO7cvK22ugo0hXoU1c3HL1kKLEgyoKeieiskbKy4AaTy2jhqCmbBp8PazlibBxEiChvdta_YNXpFmis8Wleb0IgBhcsqpAllhZ3tBcNCimdQoOw4VyochX5pKAdB8bxWyJ7M8rn5qokOGpQlLiDyAm0dMbzXekxpL6tbzZmWWUSnVj8VCfJ3hh2PLN973DtOuxIb-3x0Ru-ukXULR9ozG1jWc06foINVwIXnlKk1xT7JtjOQ</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="AudioFluxTG" enabled="false">
        <intProp name="ThreadGroup.num_threads">6</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Audio flux" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">4550</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/audio/preview/1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept</stringProp>
              <stringProp name="Header.value">text/event-stream</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6ImtXYmthYTZxczh3c1RuQndpaU5ZT2hIYm5BdyJ9.eyJhdWQiOiJkZWMzYmUzMC02MzI1LTQzMzUtYjg5OC1lYjAxOTg1ZDZjOTAiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vNTMxZmY5NmQtMGFlOS00NjJhLThkMmQtYmVjN2MwYjQyMDgyL3YyLjAiLCJpYXQiOjE3MDY3MDU2NTEsIm5iZiI6MTcwNjcwNTY1MSwiZXhwIjoxNzA2NzExMjQxLCJhaW8iOiJBVFFBeS84VkFBQUFuUUppeFBOeUxLUVNXWk96R0FwZURLVUVPVW1Za0pqYk91eW0wRnBCVFEzeTBaS3h2b0xuZUozYzI2Wm5rYzdIIiwiYXpwIjoiZGVjM2JlMzAtNjMyNS00MzM1LWI4OTgtZWIwMTk4NWQ2YzkwIiwiYXpwYWNyIjoiMSIsIm5hbWUiOiJkYXJ0c2ludGVybmFsZnVuY3Rpb25hbHRlc3R1c2VyIiwib2lkIjoiYjNiN2VkN2YtOTU5Ni00NmVjLWExMTktYmZiNjJkYThhMzM4IiwicHJlZmVycmVkX3VzZXJuYW1lIjoiZGFydHNpbnRlcm5hbGZ1bmN0aW9uYWx0ZXN0dXNlckBITUNUUy5ORVQiLCJyaCI6IjAuQVNBQWJma2ZVLWtLS2thTkxiN0h3TFFnZ2pDLXc5NGxZelZEdUpqckFaaGRiSkFnQUpJLiIsInNjcCI6ImRhcnRzaW50ZXJuYWx1c2VyIEZ1bmN0aW9uYWwuVGVzdCIsInN1YiI6IlJ4eXlyWjlydjlyMUNfQl93bkcxaEZGZEFwclNSaGlUQ3YwUjF2SGxaYXMiLCJ0aWQiOiI1MzFmZjk2ZC0wYWU5LTQ2MmEtOGQyZC1iZWM3YzBiNDIwODIiLCJ1dGkiOiJxdUE4WWlpTFowcUcxUlZxczhRWUFBIiwidmVyIjoiMi4wIn0.IzOlL7LDyk6pl66vjkxxgx6afLgE2Rea28FqYGQcyv43XjucHZFbGzkW8YDvnKFtPA00ynIDuq0aD-1vkLR5dcC5zZpNJCHMBvH10YRvM4kuLt6efIDIhMIPFJ8YQsFRQQ4WI4iSfn2fiT9infzhGP49ICPCpxTyd7mbLZT_dYEkMiiInFNjYmyZnY1L9rnt3zHHDCq7e3ljby9eSq7SKyu2U7o4D_NjB8Ks6VliTFF1bzscrP4qE7o6yWTPHDUwGjrPd2gYdmPGgOFgVWf0TLnQVjdNyeUhz7LepKjT_u6V8H746uIkWFxIn9nZNufuD9vW0TT3PAHxM-Ro1xdE4w</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="AudioSSEEMITERTG">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">2</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Audio flux" enabled="true">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">4550</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/audio/preview/1</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">accept</stringProp>
              <stringProp name="Header.value">text/event-stream</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6ImtXYmthYTZxczh3c1RuQndpaU5ZT2hIYm5BdyJ9.eyJhdWQiOiJkZWMzYmUzMC02MzI1LTQzMzUtYjg5OC1lYjAxOTg1ZDZjOTAiLCJpc3MiOiJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vNTMxZmY5NmQtMGFlOS00NjJhLThkMmQtYmVjN2MwYjQyMDgyL3YyLjAiLCJpYXQiOjE3MDY4NjgxOTIsIm5iZiI6MTcwNjg2ODE5MiwiZXhwIjoxNzA2ODczNTE3LCJhaW8iOiJBVFFBeS84VkFBQUE5eU16Z0phNlkyUVNoOS9KbnFFR2NjUC9pQXdFQXFvZWZYc2VYbDhTZlJUOHVVaSt6K0N3eHFZM0ptNFE0N0NkIiwiYXpwIjoiZGVjM2JlMzAtNjMyNS00MzM1LWI4OTgtZWIwMTk4NWQ2YzkwIiwiYXpwYWNyIjoiMSIsIm5hbWUiOiJkYXJ0c2ludGVybmFsZnVuY3Rpb25hbHRlc3R1c2VyIiwib2lkIjoiYjNiN2VkN2YtOTU5Ni00NmVjLWExMTktYmZiNjJkYThhMzM4IiwicHJlZmVycmVkX3VzZXJuYW1lIjoiZGFydHNpbnRlcm5hbGZ1bmN0aW9uYWx0ZXN0dXNlckBITUNUUy5ORVQiLCJyaCI6IjAuQVNBQWJma2ZVLWtLS2thTkxiN0h3TFFnZ2pDLXc5NGxZelZEdUpqckFaaGRiSkFnQUpJLiIsInNjcCI6ImRhcnRzaW50ZXJuYWx1c2VyIEZ1bmN0aW9uYWwuVGVzdCIsInN1YiI6IlJ4eXlyWjlydjlyMUNfQl93bkcxaEZGZEFwclNSaGlUQ3YwUjF2SGxaYXMiLCJ0aWQiOiI1MzFmZjk2ZC0wYWU5LTQ2MmEtOGQyZC1iZWM3YzBiNDIwODIiLCJ1dGkiOiJzVmRvYW9SNXZrYXg0V1dTWXFnVUFBIiwidmVyIjoiMi4wIn0.c--1EkRtwwFeyORjFCUFtAKx3M9hWFjIGNvZpQ_d_OzA-x-GacqIHP1SGkeiIyZrl4Q0Rs5G6EijK_A5a1dg_F-p43xD6UKgqAdGg-Us5TSwPMAaqnULEJ4X6LlbPwhM3aB9iRVN1gsOyci4AEyCTnG4hW332nHWqqODqPyZZHiXLl2YtT8KNy-cLmiz-VFIzKKdOiWyD1AIAr4afSkpT7Y5scBSWcWJzAOt26IGAcFT_bLvzw8Ly2o17a7gZPSiZ1xolrKDJnwhg6C4zJt8mgoUI_Q1ql1Zh_lkJYCPQhBeNINxZiaYeJrEG2skVtdlM1rQ0-rt8rKabhyklsmufw</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>